#ifndef TASKDESCRIPTION_H
#define TASKDESCRIPTION_H

#endif // TASKDESCRIPTION_H


// 1. В софтуерна фирма има два вида служители – програмисти и мениджъри. Отдел “личен състав” поддържа следната информация за всеки от програмистите:
// * потребителско име;
// * стаж (в месеци);
// * заплата;
// * дали знае C++.
//  И следната информация за всеки от мениджърите:
// * потребителско име;
// * стаж (в месеци);
// * заплата;
// * колко човека управлява.
//  Да се напише програма, която позволява на отдел “личен състав” да поддържа списък с всички програмисти и мениджъри във фирмата.
//     Програмата да може да извършва следните операции:
// * постъпване на нов служител;
// * напускане на служител;
// * извеждане на списък с данни за всички служители.

//  Да се въведат примерни данни за служители в софтуерна фирма и над тях да се изпълнят следните операции:
// * изтриване на всички служители, които имат стаж по-малко от 3 месеца;
// * увеличаване на заплатата на всички служители с 1% от текущото им възнаграждение за всяка година стаж.
